> Projeto Desenvolve <br>
Programação Intermediária com Python <br>
Profa. Camila Laranjeira (mila@projetodesenvolve.com.br) <br>

# 3.14 - ORM

## Exercícios

#### Q1. Conhecendo os dados
Baixe o seguinte csv onde iremos trabalhar. Ele contém informações sobre salários de profissionais de dados de uma empresa hipotética entre 2009 e 2016
* https://github.com/camilalaranjeira/python-intermediario/blob/main/salaries.csv

Suas colunas, descritas na [página do Kaggle que contém o dataset](https://www.kaggle.com/datasets/krishujeniya/salary-prediction-of-data-professions?resource=download), são:
* FIRST NAME: Primeiro nome do profissional de dados (String)
* LAST NAME: Sobrenome do profissional de dados (String)
* SEX: Gênero do profissional de dados (String: 'F' para Feminino, 'M' para Masculino)
* DOJ (Date of Joining): A data em que o profissional de dados ingressou na empresa (Data no formato MM/DD/AAAA)
* CURRENT DATE: A data atual ou a data de referência dos dados (Data no formato MM/DD/AAAA)
* DESIGNATION: O cargo ou designação do profissional de dados (String: ex., Analista, Analista Sênior, Gerente)
* AGE: Idade do profissional de dados (Integer)
* SALARY: Salário anual do profissional de dados (Float)
* UNIT: Unidade de negócios ou departamento em que o profissional de dados trabalha (String: ex., TI, Finanças, Marketing)
* LEAVES USED: Número de licenças utilizadas pelo profissional de dados (Integer)
* LEAVES REMAINING: Número de licenças restantes para o profissional de dados (Integer)
* RATINGS: Avaliações de desempenho do profissional de dados (Float)
* PAST EXP: Experiência de trabalho anterior em anos antes de ingressar na empresa atual (Float)

Na célula a seguir, **carregue os dados do CSV e dê uma olhada neles antes de seguir**.

In [1]:
### Escreva sua resposta aqui
import pandas as pd

# Carregar o CSV
df = pd.read_csv('salaries.csv')

# Exibir as primeiras 5 linhas
print("Primeiras 5 linhas do dataset:")
display(df.head())

# Exibir informações gerais sobre o dataset
print("\nInformações gerais do dataset:")
df.info()

Primeiras 5 linhas do dataset:

,FIRST NAME,LAST NAME,SEX,DOJ,CURRENT DATE,DESIGNATION,AGE,SALARY,UNIT,LEAVES USED,LEAVES REMAINING,RATINGS,PAST EXP
0,TOMASA,ARMEN,F,5-18-2014,01-07-2016,Analyst,21.0,44570,Finance,24.0,6.0,2.0,0
1,ANNIE,NaN,F,NaN,01-07-2016,Associate,NaN,89207,Web,NaN,13.0,NaN,7
2,OLIVE,ANCY,F,7-28-2014,01-07-2016,Analyst,21.0,40955,Finance,23.0,7.0,3.0,0
3,CHERRY,AQUILAR,F,04-03-2013,01-07-2016,Analyst,22.0,45550,IT,22.0,8.0,3.0,0
4,LEON,ABOULAHOUD,M,11-20-2014,01-07-2016,Analyst,NaN,43161,Operations,27.0,3.0,NaN,3

Informações gerais do dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2639 entries, 0 to 2638
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   FIRST NAME        2639 non-null   object
 1   LAST NAME         2637 non-null   object
 2   SEX               2639 non-null   object
 3   DOJ               2638 non-null   object
 4   CURRENT DATE      2639 non-null   object
 5   DESIGNATION       2639 non-null   object
 6   AGE               2636 non-null   float64
 7   SALARY            2639 non-null   int64
 8   UNIT              2639 non-null   object
 9   LEAVES USED       2636 non-null   float64
 10  LEAVES REMAINING  2637 non-null   float64
 11  RATINGS           2637 non-null   float64
 12  PAST EXP          2639 non-null   int64
dtypes: float64(4), int64(2), object(7)
memory usage: 268.1+ KB

#### Q2. Modelando os dados
Você deve **criar um ORM com SQLAlchemy capaz de comportar os dados dessa base**.

* Crie um campo de chave primária `ID`, que deve ser incrementado automaticamente
* Os campos SEX, DESIGNATION e UNIT devem ser definidos como classes `Enum` com os possíveis valores (consulte os valores únicos dessas colunas)
* Para os outros campos, consulte os tipos de dados informados na descrição acima

In [4]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading sqlalchemy-2.0.39-cp310-cp310-win_amd64.whl.metadata (9.9 kB)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Downloading greenlet-3.1.1-cp310-cp310-win_amd64.whl.metadata (3.9 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\kennedy\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (4.12.2)
Downloading sqlalchemy-2.0.39-cp310-cp310-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------- ----- 1.8/2.1 MB 16.7 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 14.7 MB/s eta 0:00:00
Downloading greenlet-3.1.1-cp310-cp310-win_amd64.whl (298 kB)
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.1.1 sqlalchemy-2.0.39

In [25]:
from sqlalchemy import Column, Integer, String, Float, Date, Enum
from sqlalchemy.ext.declarative import declarative_base
import enum

Base = declarative_base()

class SexEnum(enum.Enum):
    F = "F"
    M = "M"

class DesignationEnum(enum.Enum):
    Analyst = "Analyst"
    Senior_Analyst = "Senior Analyst"
    Manager = "Manager"
    Senior_Manager = "Senior Manager"
    Associate = "Associate"
    Director = "Director"

class UnitEnum(enum.Enum):
    IT = "IT"
    Finance = "Finance"
    Marketing = "Marketing"
    Operations = "Operations"
    Sales = "Sales"
    Management = "Management"

class Employee(Base):
    __tablename__ = 'employees'
    id = Column(Integer, primary_key=True, autoincrement=True)
    first_name = Column(String(50))
    last_name = Column(String(50))
    sex = Column(Enum(SexEnum))
    doj = Column(Date)
    current_date = Column(Date)
    designation = Column(Enum(DesignationEnum))
    age = Column(Integer)
    salary = Column(Float)
    unit = Column(Enum(UnitEnum))
    leaves_used = Column(Integer)
    leaves_remaining = Column(Integer)
    ratings = Column(Float)
    past_exp = Column(Float)

print("Modelo Employee criado com sucesso!")

Modelo Employee criado com sucesso!

C:\Users\Kennedy\AppData\Local\Temp\ipykernel_13208\4004226593.py:5: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

#### Q3. Estabelecendo uma conexão

Usando o método `create_engine` do SQLAlchemy, crie uma conexão com um novo banco de dados SQLite chamado `salarios`.

In [6]:
### Escreva sua resposta aqui
from sqlalchemy import create_engine

# Criar a engine para o banco SQLite
engine = create_engine('sqlite:///salarios.db', echo=True)

print("Conexão com o banco 'salarios.db' estabelecida!")

Conexão com o banco 'salarios.db' estabelecida!

#### Q4. Criando as tabelas
Crie as tabelas da questão Q2 no banco `salarios`.

In [26]:
### Escreva sua resposta aqui
Base.metadata.create_all(engine)

print("Tabela 'employees' criada no banco 'salarios.db'!")

2025-03-20 17:50:55,825 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-03-20 17:50:55,826 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("employees")
2025-03-20 17:50:55,827 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:50:55,828 INFO sqlalchemy.engine.Engine COMMIT
Tabela 'employees' criada no banco 'salarios.db'!

#### Q5. Populando

Usando o método `to_sql` da biblioteca Pandas (veja [a documentação](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html)), popule o banco `salarios` com os dados do csv que você carregou na questão Q1.
* Lembre-se de definir o parâmetro `if_exists='append'` para que as tabelas não sejam dropadas e recriadas.

In [27]:
import pandas as pd

# Reutilizar o DataFrame do exercício 1
# Renomear as colunas do DataFrame para corresponder ao modelo Employee
df = df.rename(columns={
    'FIRST NAME': 'first_name',
    'LAST NAME': 'last_name',
    'SEX': 'sex',
    'DOJ': 'doj',
    'CURRENT DATE': 'current_date',
    'DESIGNATION': 'designation',
    'AGE': 'age',
    'SALARY': 'salary',
    'UNIT': 'unit',
    'LEAVES USED': 'leaves_used',
    'LEAVES REMAINING': 'leaves_remaining',
    'RATINGS': 'ratings',
    'PAST EXP': 'past_exp'
})

# Converter colunas de data para o formato datetime
df['doj'] = pd.to_datetime(df['doj'], format='%m-%d-%Y')
df['current_date'] = pd.to_datetime(df['current_date'], format='%m-%d-%Y')

# Mapear os valores de 'designation' para corresponder ao DesignationEnum
designation_mapping = {
    'Analyst': 'Analyst',
    'Senior Analyst': 'Senior_Analyst',
    'Manager': 'Manager',
    'Senior Manager': 'Senior_Manager',
    'Associate': 'Associate',
    'Director': 'Director'
}
df['designation'] = df['designation'].map(designation_mapping)

# Popule a tabela 'employees'
df.to_sql('employees', engine, if_exists='replace', index=False)  # 'replace' para sobrescrever os dados antigos

print("Dados populados na tabela 'employees' com sucesso!")

2025-03-20 17:51:05,760 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-03-20 17:51:05,762 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("employees")
2025-03-20 17:51:05,763 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,765 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("employees")
2025-03-20 17:51:05,765 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,766 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2025-03-20 17:51:05,767 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,768 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='view' AND name NOT LIKE 'sqlite~_%' ESCAPE '~' ORDER BY name
2025-03-20 17:51:05,768 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,769 INFO sqlalchemy.engine.Engine PRAGMA main.table_xinfo("employees")
2025-03-20 17:51:05,770 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,771 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-03-20 17:51:05,771 INFO sqlalchemy.engine.Engine [raw sql] ('employees',)
2025-03-20 17:51:05,772 INFO sqlalchemy.engine.Engine PRAGMA main.foreign_key_list("employees")
2025-03-20 17:51:05,773 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,774 INFO sqlalchemy.engine.Engine PRAGMA temp.foreign_key_list("employees")
2025-03-20 17:51:05,774 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,775 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-03-20 17:51:05,776 INFO sqlalchemy.engine.Engine [raw sql] ('employees',)
2025-03-20 17:51:05,777 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("employees")
2025-03-20 17:51:05,777 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,778 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("employees")
2025-03-20 17:51:05,779 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,780 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("employees")
2025-03-20 17:51:05,781 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,782 INFO sqlalchemy.engine.Engine PRAGMA main.index_list("employees")
2025-03-20 17:51:05,783 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,784 INFO sqlalchemy.engine.Engine PRAGMA temp.index_list("employees")
2025-03-20 17:51:05,785 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,786 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("employees")
2025-03-20 17:51:05,786 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-03-20 17:51:05,787 INFO sqlalchemy.engine.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type in ('table', 'view')
2025-03-20 17:51:05,788 INFO sqlalchemy.engine.Engine [raw sql] ('employees',)
2025-03-20 17:51:05,790 INFO sqlalchemy.engine.Engine
DROP TABLE employees
2025-03-20 17:51:05,791 INFO sqlalchemy.engine.Engine [no key 0.00101s] ()
2025-03-20 17:51:06,297 INFO sqlalchemy.engine.Engine
CREATE TABLE employees (
	first_name TEXT,
	last_name TEXT,
	sex TEXT,
	doj DATETIME,
	"current_date" DATETIME,
	designation TEXT,
	age FLOAT,
	salary BIGINT,
	unit TEXT,
	leaves_used FLOAT,
	leaves_remaining FLOAT,
	ratings FLOAT,
	past_exp BIGINT
)


2025-03-20 17:51:06,297 INFO sqlalchemy.engine.Engine [no key 0.00056s] ()
2025-03-20 17:51:06,428 INFO sqlalchemy.engine.Engine INSERT INTO employees (first_name, last_name, sex, doj, "current_date", designation, age, salary, unit, leaves_used, leaves_remaining, ratings, past_exp) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
2025-03-20 17:51:06,428 INFO sqlalchemy.engine.Engine [generated in 0.02393s] [('TOMASA', 'ARMEN', 'F', '2014-05-18 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', 21.0, 44570, 'Finance', 24.0, 6.0, 2.0, 0), ('ANNIE', None, 'F', None, '2016-01-07 00:00:00.000000', 'Associate', None, 89207, 'Web', None, 13.0, None, 7), ('OLIVE', 'ANCY', 'F', '2014-07-28 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', 21.0, 40955, 'Finance', 23.0, 7.0, 3.0, 0), ('CHERRY', 'AQUILAR', 'F', '2013-04-03 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', 22.0, 45550, 'IT', 22.0, 8.0, 3.0, 0), ('LEON', 'ABOULAHOUD', 'M', '2014-11-20 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', None, 43161, 'Operations', 27.0, 3.0, None, 3), ('VICTORIA', None, 'F', '2013-02-19 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', 22.0, 48736, 'Marketing', 20.0, 10.0, 4.0, 0), ('ELLIOT', 'AGULAR', 'M', '2013-09-02 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', 22.0, 40339, 'Marketing', 19.0, 11.0, 5.0, 0), ('JACQUES', 'AKMAL', 'M', '2013-12-05 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', None, 40058, 'Marketing', 29.0, 1.0, 2.0, 2)  ... displaying 10 of 2639 total bound parameter sets ...  ('TERI', 'ANASTASIO', 'F', '2014-03-17 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', 24.0, 45172, 'Web', 23.0, 7.0, 3.0, 1), ('GREGORY', 'ABARCA', 'M', '2014-09-18 00:00:00.000000', '2016-01-07 00:00:00.000000', 'Analyst', 24.0, 49176, 'Marketing', 17.0, 13.0, 2.0, 2)]
2025-03-20 17:51:06,435 INFO sqlalchemy.engine.Engine COMMIT
Dados populados na tabela 'employees' com sucesso!

#### Q6. Consultas SQL vs ORM

Agrupe os dados por DESIGNATION e selecione o mínimo, máximo e a média dos salários (SALARY) divididos por 12. Já que o atributo SALARY é anual, dividir por 12 nos mostrará os valores mensais.

Assumindo que a variável que armazena a sua conexão se chama `engine`, você deve realizar a query acima de três formas:
* Executando a query SQL através de uma instância de conexão retornada pelo método `engine.connect()`
* Executando a query SQL com o método `read_sql_query` do Pandas (veja [a documentação](https://pandas.pydata.org/docs/reference/api/pandas.read_sql_query.html)). Você usará mesma instância `engine.connect()` como um dos parâmetros.
* Executando uma query criada com o módulo `select` do SQLAlchemy. Sua execução deve ser feita através de um objeto `Session` do módulo `orm` do SQLAlchemy (`Session(engine)`).

In [30]:
### Execute aqui sua query SQL com SQLAlchemy
from sqlalchemy import text

# Query SQL pura usando engine.connect()
query_sql = """
SELECT designation,
       MIN(salary/12) as min_salary_monthly,
       MAX(salary/12) as max_salary_monthly,
       AVG(salary/12) as avg_salary_monthly
FROM employees
GROUP BY designation
"""

with engine.connect() as conn:
    result_sql = conn.execute(text(query_sql)).fetchall()
    print("\nResultado com engine.connect():")
    for row in result_sql:
        print(f"Designation: {row[0]}, Min: {row[1]:.2f}, Max: {row[2]:.2f}, Avg: {row[3]:.2f}")

2025-03-20 17:51:35,776 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-03-20 17:51:35,777 INFO sqlalchemy.engine.Engine
SELECT designation,
       MIN(salary/12) as min_salary_monthly,
       MAX(salary/12) as max_salary_monthly,
       AVG(salary/12) as avg_salary_monthly
FROM employees
GROUP BY designation

2025-03-20 17:51:35,778 INFO sqlalchemy.engine.Engine [cached since 824.2s ago] ()

Resultado com engine.connect():
Designation: None, Min: 4170.00, Max: 16631.00, Avg: 6459.29
Designation: Analyst, Min: 3333.00, Max: 4165.00, Avg: 3751.22
Designation: Associate, Min: 5846.00, Max: 8300.00, Avg: 7266.47
Designation: Director, Min: 17832.00, Max: 32342.00, Avg: 23913.94
Designation: Manager, Min: 8343.00, Max: 12407.00, Avg: 10522.25
2025-03-20 17:51:35,781 INFO sqlalchemy.engine.Engine ROLLBACK

In [29]:
### Execute aqui sua query SQL com SQLAlchemy + Pandas
import pandas as pd

# Query SQL usando Pandas read_sql_query
query_sql = """
SELECT designation,
       MIN(salary/12) as min_salary_monthly,
       MAX(salary/12) as max_salary_monthly,
       AVG(salary/12) as avg_salary_monthly
FROM employees
GROUP BY designation
"""

with engine.connect() as conn:
    df_pandas = pd.read_sql_query(query_sql, conn)
    print("\nResultado com Pandas read_sql_query:")
    display(df_pandas)

2025-03-20 17:51:26,773 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-03-20 17:51:26,774 INFO sqlalchemy.engine.Engine
SELECT designation,
       MIN(salary/12) as min_salary_monthly,
       MAX(salary/12) as max_salary_monthly,
       AVG(salary/12) as avg_salary_monthly
FROM employees
GROUP BY designation

2025-03-20 17:51:26,775 INFO sqlalchemy.engine.Engine [raw sql] ()

Resultado com Pandas read_sql_query:

  designation  min_salary_monthly  max_salary_monthly  avg_salary_monthly
0        None                4170               16631         6459.287081
1     Analyst                3333                4165         3751.217034
2   Associate                5846                8300         7266.465409
3    Director               17832               32342        23913.937500
4     Manager                8343               12407        10522.246914

2025-03-20 17:51:26,783 INFO sqlalchemy.engine.Engine ROLLBACK

In [28]:
### Execute aqui sua query com SQLAlchemy ORM
from sqlalchemy.orm import Session
from sqlalchemy import func, select

# Query usando SQLAlchemy ORM com Session
session = Session(engine)

query_orm = (
    select(Employee.designation,
           func.min(Employee.salary/12).label('min_salary_monthly'),
           func.max(Employee.salary/12).label('max_salary_monthly'),
           func.avg(Employee.salary/12).label('avg_salary_monthly'))
    .group_by(Employee.designation)
)

result_orm = session.execute(query_orm).all()
print("\nResultado com SQLAlchemy ORM:")
for row in result_orm:
    print(f"Designation: {row[0]}, Min: {row[1]:.2f}, Max: {row[2]:.2f}, Avg: {row[3]:.2f}")

session.close()

2025-03-20 17:51:19,953 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-03-20 17:51:19,956 INFO sqlalchemy.engine.Engine SELECT employees.designation, min(employees.salary / (? + 0.0)) AS min_salary_monthly, max(employees.salary / (? + 0.0)) AS max_salary_monthly, avg(employees.salary / (? + 0.0)) AS avg_salary_monthly
FROM employees GROUP BY employees.designation
2025-03-20 17:51:19,956 INFO sqlalchemy.engine.Engine [generated in 0.00073s] (12, 12, 12)

Resultado com SQLAlchemy ORM:
Designation: None, Min: 4170.33, Max: 16631.42, Avg: 6459.74
Designation: DesignationEnum.Analyst, Min: 3333.42, Max: 4165.00, Avg: 3751.68
Designation: DesignationEnum.Associate, Min: 5846.17, Max: 8300.25, Avg: 7266.92
Designation: DesignationEnum.Director, Min: 17832.25, Max: 32342.67, Avg: 23914.27
Designation: DesignationEnum.Manager, Min: 8343.67, Max: 12407.50, Avg: 10522.72
2025-03-20 17:51:19,959 INFO sqlalchemy.engine.Engine ROLLBACK